usage = int(input("请输入用电量："))
if usage <= 2880:
    cost = usage * 0.4883
elif 2880 < usage <= 4800:
    # 前 2880 度按一档，剩下的按二档
    cost = 2880 * 0.4883 + (usage - 2880) * 0.5383
else:
    # 前 2880 度按一档，中间按二档，剩下的按三档
    cost = 2880 * 0.4883 + (4800 - 2880) * 0.5383 + (usage - 4800) * 0.7883
print(f"电费为: {cost:.2f} 元")
# A = int(input("请输入用电量："))
# if A <= 2880:
#     print("电费为：", A * 0.4883, "元")
# elif 2880 < A <= 4800:
#     print("电费为："，A * 0.4883 + (A - 2880) * 0.5383, "元")
# else:
#     print("电费为：", 2880 * 0.4883 + (A - 2880) * 0.5383, "元")